IDEA Connection Link
IProgressCallback.ProgressMessage Method (Double, String, String)
 infomation about progress of event.
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
void ProgressMessage(
	double percent,
	string message,
	string iteration
)
Sub ProgressMessage (
	percent As Double,
	message As String,
	iteration As String
)
void ProgressMessage(
	double percent,
	String^ message,
	String^ iteration
)
Parameters
percent
Type: System.Double
percentage of event status
message
Type: System.String
message
iteration
Type: System.String
Number of the iteration (FEM solver steps)
See Also
Reference
IProgressCallback Interface
ProgressMessage Overload
IdeaRS.ConnectionService.Service Namespace